//选择结构-多条件if语句

//if（条件1）{条件1满足执行的语句}else if（条件2）{条件2满足执行的语句}...else{都不满足执行的语句}


#include<iostream>
using namespace std;

int main()
{
    //1.用户输入分数
    int score=0;
    cout<<"请输入一个分数："<<"\n";
    cin>>score;

    //2.打印用户输入的分数
    cout<<"你输入的分数为："<<score<<"\n";

    //3.判断用户的分数
    //大于500：输出“还可以，加油”，
    //大于400：输出“在大学要加油”，
    //小于等于400：输出“没事的，加油”。
    if(score>500)//大于500分执行下面大括号的内容
    {
        cout<<"还可以，加油！"<<"\n";
    }
    else if(score>400)//大于等于400但是小于500分执行else if下面大括号的内容
    {
        cout<<"在大学要加油！"<<"\n";
    }
    else//小于等于400分执行else下面大括号的内容
    {
        cout<<"没事的，加油！"<<"\n";
    }
    
    system("pause");

    return 0;   
}