//指针-const修饰指针

//const翻译为常量，*翻译为指针，可以根据两者的先后顺序来记忆
//const后面是谁，谁就不可以改

//有3种情况
//1.const修饰指针------常量指针：int const * p = &a;
//特点：指针的指向可以修改，指针指向的值不可以修改
//（个人理解）：相当于搬家，可以换地址，但不能换里面的对应的人（值）

//2.const修饰常量------指针常量：int * const p = &a;
//特点：指针指向的值不可以修改，指针的指向可以修改


//3.const既修饰指针，又修饰常量：const int * const p = &a;
//特点：指针的指向和指针指向的值都不可以改

#include<iostream>
using namespace std;

int main()
{
    //1.const修饰指针----常量指针
    int a = 10;
    int b = 10;

    const int * p1 = &a;
    //特点：指针的指向可以修改，指针指向的值不可以修改
    p1 = &b;   //正确
    //*p1 = 20;//错误

    //2.const修饰常量----指针常量
    int * const p2 = &a;
    //特点：指针指向的值不可以修改，指针的指向可以修改
    *p2 = 100; //正确
    //p2 = &b; //错误





    //3.const既修饰指针，又修饰常量
    int const * const p3 = &a;
    //特点：指针的指向和指针指向的值都不可以改
    //*p2 = 100; //错误
    //p2 = &b;   //错误   





    //下面3行是没有用，只是为了防止因定义的量未使用而导致出现警告
    cout << *p1 << endl;
    cout << *p2 << endl;
    cout << *p3 << endl;

    return 0;   
}