// acwing- 32.最小生成树1-朴素Prim算法

// 最小生成树
//  1.普利姆算法(Prim)
//      **(1).朴素版Prim算法       O(n^2)   ---------- 适合稠密图
//      (2).堆优化版Prim算法     O(mlogn)  ---------- 适合稀疏图
//  2.**克鲁斯卡尔算法(Kruskal)    O(mlogm)  ---------- 适合稀疏图

// (稀疏图一般用Kruskal，因为相较于 堆优化版Prim ，代码更简单，思路更清晰）


// 题目来源：AcWing 858. Prim算法求最小生成树

// 一、题目描述
// 给定一个 n 个点 m 条边的无向图，图中可能存在重边和自环，边权可能为负数。
// 求最小生成树的树边权重之和，如果最小生成树不存在则输出 impossible。
// 给定一张边带权的无向图 G=(V,E)，其中 V 表示图中点的集合，E 表示图中边的集合，n=|V|, m=|E|。
// 由 V 中的全部 n 个顶点和 E 中 n-1 条边构成的无向连通子图被称为 G 的一棵生成树，其中边的权值之和最小的生成树被称为无向图 G 的最小生成树。

// 输入格式
// 第一行包含两个整数 n 和 m。
// 接下来 m 行，每行包含三个整数 u,v,w，表示点 u 和点 v 之间存在一条权值为 w 的边。

// 输出格式
// 共一行，若存在最小生成树，则输出一个整数，表示最小生成树的树边权重之和，如果最小生成树不存在则输出 impossible。

// 数据范围
// 1 ≤ n ≤ 500, 1 ≤ m ≤ 10^5
// 图中涉及边的边权的绝对值均不超过 10000。

// 输入样例：
// 4 5
// 1 2 1
// 1 3 2
// 1 4 3
// 2 3 2
// 3 4 4

// 输出样例：
// 6

// 二、最小生成树 Prim算法
// 什么是最小生成树问题？
// 假设地图中有很多城市，现在需要在城市中修建一条公路，使得各个城市可以联通（类似于主线），现在询问最小需要修多少距离的公路。
// 凡是最小生成树的问题，一般而言对应的图是无向图。而解决最小生成树问题通常使用的是 Prim 和 Kruskal 算法。
// 一般而言，对于稠密图的最小生成树问题我们使用Prim算法，时间复杂度是O(n^2)；
// 对于稀疏图，我们一般使用的是Kruskal算法，时间复杂度是 O(mlogm)。
// Prim算法与朴素版的Dijkstra算法非常相像。
// 伪代码如下：
// 首先，初始化距离数组 dist 为正无穷，表示每个点到最小生成树的距离初始都是 ∞
//     for (int i = 0; i < n; i++)
//     {
//         t ← 找到最小生成树之外，距离最小生成树最近的点
//         用 t 更新其他点到最小生成树的距离
//         将 t 加入到最小生成树中去
//     }
// 注意：
// 用 t 更新其他点到最小生成树的距离是指，如果其他点到最小生成树有多条边，那么只取最短的那一条。
// 如果不存在任何一条边与最小生成树相连，则目前距离仍为正无穷。


#include<iostream>
#include<cstring>
#include<algorithm>

using namespace std;

const int N = 510, INF = 0x3f3f3f3f;

int n, m;
int g[N][N];
int dist[N];
bool st[N];

int prim()
{
    memset(dist, 0x3f, sizeof dist);

    int res = 0;
    for(int i = 0; i < n; i++)
    {
        int t = -1;
        for(int j = 1; j <= n; j++)
            if(!st[j] && (t == -1 || dist[t] > dist[j]))
                t = j;
    

        if(i && dist[t] == INF) return INF; // 如果存在一个点到最小生成树的距离是正无穷，那么就说明这个图不是连通图，即不存在最小生成树
        if(i) res += dist[t]; // 如果不是第一个点，则将距离加入到最小生成树中去

        for(int j = 1; j <= n; j++)
            dist[j] = min(dist[j], g[t][j]); // 用t更新其他点到最小生成树的距离
            // (与Dijkstra算法的区别是Dijkstra算法是用t更新其他点到起点的距离，即代码是 dist[j] = min(dist[j], dist[j] + g[t][j]);
        // 为什么要先累加再更新呢？
        // 因为Prim算法是用t更新其他点到最小生成树的距离，所以需要先累加再更新

        st[t] = true; // 将t加入到最小生成树中去

    }

    return res;
}

int main()
{
    scanf("%d%d", &n, &m);

    memset(g, 0x3f, sizeof g);

    while(m--)
    {
        int a, b, c;
        scanf("%d%d%d", &a, &b, &c);
        g[a][b] = g[b][a] = min(g[a][b], c);
    }

    int t = prim();

    if(t == INF) puts("impossible");
    else printf("%d\n", t);

    return 0;
}