//输出双层金字塔

//每输出一次数字，输出一次该数字高度对称的双层金字塔

#include<iostream>
using namespace std;

int main()
{
    int a;
    while(cin>>a)
    {
        //外层循环1：正三角形（大）：高度：a行
        for(int i = 1; i<=a; i++)
        {
            //内层循环1：空格“ ”个数：正三角形高度a - 当前的行数i；
            for(int j = 1; j<=a-i; j++)//也可以：for(int j=a; k>i; k--)
            {
                cout << " ";
            }
            //内层循环2：*个数：2倍当前行数2*i - 1；
            for(int k = 1; k<=2*i-1; k++)
            {
                cout << "*";
            }
            cout << endl;
        }
        //外层循环：倒三角形（小）：高度：a-1行（对应第一行）到高度为1的最后一行（对应第a-1行）
        for(int i = 1; i<=a-1; i++) 
        {
            //内层循环1：空格“ ”个数：从当前高度a-1行（对应倒三角形第一行）开始，当前高度逐渐减少，同时空格“ ”个数：为当前高度a-1 + 1
            for(int j = i; j>=1; j--)
            {
                cout << " ";
            }
            //内层循环2：*个数：从当前高度a-1行（对应倒三角形第一行）开始，当前高度逐渐减少，同时*个数：为2倍当前高度（也就是高度a减去第几行减去1：(2*(a-i)-1)））
            for(int k = 2*(a-i)-1; k>=1; k--)
            {
                cout << "*";
            }
            cout << endl;
        }
            
    }
    

    system("pause");
    return 0;
}